/* global $Ctx */

$Ctx.Spec = {
    template: {
        mblno: /18818881\d{3}/,
        'failreason|1': [
            '',
            'DELIVRD',
        ],
        'msgst|1': [
            0,
            4,
        ],
        'msgcntnt|1': [
            '上海银行威萌虎生肖借记卡，做工精美，祝您的生活如虎添翼！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡—生肖卡”即可申请，详询95594。[回复TD退订]',
            '上海银行招财猫主题借记卡，做工精美，祝您好运滚滚来！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡-招财猫主题借记卡”即可申请，详询95594。[回复TD退订]',
            '上海银行招财猫主题借记卡，做工精美，祝您好运滚滚来！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡-招财猫主题借记卡”即可申请，详询95594。[回复TD退订]',
            '上海银行许愿卡（借记卡），做工精美，祝您拥有浪漫的日子，不一样的心愿！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡—许愿卡”即可申请，详询95594。[回复TD退订]',
            '上海银行许愿卡（借记卡），做工精美，祝您拥有浪漫的日子，不一样的心愿！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡—许愿卡”即可申请，详询95594。[回复TD退订]',
            '上海银行许愿卡（借记卡），做工精美，祝您拥有浪漫的日子，不一样的心愿！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡—许愿卡”即可申请，详询95594。[回复TD退订]',
             '上海银行许愿卡（借记卡），做工精美，祝您拥有浪漫的日子，不一样的心愿！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡—许愿卡”即可申请，详询95594。[回复TD退订]',
            '上海银行许愿卡（借记卡），做工精美，祝您拥有浪漫的日子，不一样的心愿！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡—许愿卡”即可申请，详询95594。[回复TD退订]',
            '上海银行许愿系列锦鲤卡（借记卡），做工精美，祝您的生活锦鲤上升、梦想成真！关注上海银行微信公众号，点击“我要办卡丨社保卡—借记卡预约办卡—许愿卡”即可申请，详询95594。[回复TD退订]',
        ],
        dt: '@datetimeRange("2022-01-01", "2022-01-01", "yyyyMMdd")' // 数据分区日期
    },
    fields: [
        'mblno',
        'failreason',
        'msgst',
        'msgcntnt',
        'dt'
    ]
}
